00make/STM32F103-BU0x_SDK/Components/HAL/DW/decadriver/deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register RX_FINFO
 **/
#define RX_FINFO_ID 0x4c
#define RX_FINFO_LEN (4U)
#define RX_FINFO_MASK 0xFFFFFFFFUL
#define RX_FINFO_RXPACC_BIT_OFFSET (20U)
#define RX_FINFO_RXPACC_BIT_LEN (12U)
#define RX_FINFO_RXPACC_BIT_MASK 0xfff00000UL
#define RX_FINFO_RXPSR_BIT_OFFSET (18U)
#define RX_FINFO_RXPSR_BIT_LEN (2U)
#define RX_FINFO_RXPSR_BIT_MASK 0xc0000UL
#define RX_FINFO_RXPRF_BIT_OFFSET (16U)
#define RX_FINFO_RXPRF_BIT_LEN (2U)
#define RX_FINFO_RXPRF_BIT_MASK 0x30000UL
#define RX_FINFO_RNG_BIT_OFFSET (15U)
#define RX_FINFO_RNG_BIT_LEN (1U)
#define RX_FINFO_RNG_BIT_MASK 0x8000U
#define RX_FINFO_RXBR_BIT_OFFSET (13U)
#define RX_FINFO_RXBR_BIT_LEN (1U)
#define RX_FINFO_RXBR_BIT_MASK 0x2000U
#define RX_FINFO_RXNSPL_BIT_OFFSET (11U)
#define RX_FINFO_RXNSPL_BIT_LEN (2U)
#define RX_FINFO_RXNSPL_BIT_MASK 0x1800U
#define RX_FINFO_RXFLEN_BIT_OFFSET (0U)
#define RX_FINFO_RXFLEN_BIT_LEN (10U)
#define RX_FINFO_RXFLEN_BIT_MASK 0x3ffU

/******************************************************************************
 * @brief Bit definitions for register RX_TIME_0
 **/
#define RX_TIME_0_ID 0x64
#define RX_TIME_0_LEN (4U)
#define RX_TIME_0_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register RX_TIME_RAW
 **/
#define RX_TIME_RAW_ID 0x70
#define RX_TIME_RAW_LEN (4U)
#define RX_TIME_RAW_MASK 0xFFFFFFFFUL
#define RX_TIME_RX_RAWST_BIT_OFFSET (0U)
#define RX_TIME_RX_RAWST_BIT_LEN (32U)
#define RX_TIME_RX_RAWST_BIT_MASK 0xffffffffUL

/******************************************************************************
 * @brief Bit definitions for register TX_TIME_LO
 **/
#define TX_TIME_LO_ID 0x74
#define TX_TIME_LO_LEN (4U)
#define TX_TIME_LO_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register TX_TIME_RAW
 **/
#define TX_TIME_RAW_ID 0x10000
#define TX_TIME_RAW_LEN (4U)
#define TX_TIME_RAW_MASK 0xFFFFFFFFUL
#define TX_TIME_TX_RAWST_BIT_OFFSET (0U)
#define TX_TIME_TX_RAWST_BIT_LEN (32U)
#define TX_TIME_TX_RAWST_BIT_MASK 0xffffffffUL

/******************************************************************************
 * @brief Bit definitions for register TX_ANTD
 **/
#define TX_ANTD_ID 0x10004
#define TX_ANTD_LEN (4U)
#define TX_ANTD_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register ACK_RESP
 **/
#define ACK_RESP_ID 0x10008
#define ACK_RESP_LEN (4U)
#define ACK_RESP_MASK 0xFFFFFFFFUL
#define ACK_RESP_W4R_TIM_BIT_OFFSET (0U)
#define ACK_RESP_W4R_TIM_BIT_LEN (20U)
#define ACK_RESP_W4R_TIM_BIT_MASK 0xfffffUL

/******************************************************************************
 * @brief Bit definitions for register TX_POWER
 **/
#define TX_POWER_ID 0x1000c
#define TX_POWER_LEN (4U)
#define TX_POWER_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register CHAN_CTRL
 **/
#define CHAN_CTRL_ID 0x10014
#define CHAN_CTRL_LEN (4U)
#define CHAN_CTRL_MASK 0xFFFFFFFFUL
#define CHAN_CTRL_RX_PCODE_BIT_OFFSET (8U)
#define CHAN_CTRL_RX_PCODE_BIT_LEN (5U)
#define CHAN_CTRL_RX_PCODE_BIT_MASK 0x1f00U
#define CHAN_CTRL_TX_PCODE_BIT_OFFSET (3U)
#define CHAN_CTRL_TX_PCODE_BIT_LEN (5U)
#define CHAN_CTRL_TX_PCODE_BIT_MASK 0xf8U
#define CHAN_CTRL_SFD_TYPE_BIT_OFFSET (1U)
#define CHAN_CTRL_SFD_TYPE_BIT_LEN (2U)
#define CHAN_CTRL_SFD_TYPE_BIT_MASK 0x6U
#define CHAN_CTRL_RF_CHAN_BIT_OFFSET (0U)
#define CHAN_CTRL_RF_CHAN_BIT_LEN (1U)
#define CHAN_CTRL_RF_CHAN_BIT_MASK 0x1U

/******************************************************************************
 * @brief Bit definitions for register LE_PEND_01
 **/
#define LE_PEND_01_ID 0x10018
#define LE_PEND_01_LEN (4U)
#define LE_PEND_01_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register LE_PEND_23
 **/
#define LE_PEND_23_ID 0x1001c
#define LE_PEND_23_LEN (4U)
#define LE_PEND_23_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register RDB_STATUS
 **/
#define RDB_STATUS_ID 0x10024
#define RDB_STATUS_LEN (4U)
#define RDB_STATUS_MASK 0xFFFFFFFFUL
#define RDB_STATUS_CP_ERR1_BIT_OFFSET (7U)
#define RDB_STATUS_CP_ERR1_BIT_LEN (1U)
#define RDB_STATUS_CP_ERR1_BIT_MASK 0x80U
#define RDB_STATUS_CIADONE1_BIT_OFFSET (6U)
#define RDB_STATUS_CIADONE1_BIT_LEN (1U)
#define RDB_STATUS_CIADONE1_BIT_MASK 0x40U
#define RDB_STATUS_RXFR1_BIT_OFFSET (5U)
#define RDB_STATUS_RXFR1_BIT_LEN (1U)
#define RDB_STATUS_RXFR1_BIT_MASK 0x20U
#define RDB_STATUS_RXFCG1_BIT_OFFSET (4U)
#define RDB_STATUS_RXFCG1_BIT_LEN (1U)
#define RDB_STATUS_RXFCG1_BIT_MASK 0x10U
#define RDB_STATUS_CP_ERR0_BIT_OFFSET (3U)
#define RDB_STATUS_CP_ERR0_BIT_LEN (1U)
#define RDB_STATUS_CP_ERR0_BIT_MASK 0x8U
#define RDB_STATUS_CIADONE0_BIT_OFFSET (2U)
#define RDB_STATUS_CIADONE0_BIT_LEN (1U)
#define RDB_STATUS_CIADONE0_BIT_MASK 0x4U
#define RDB_STATUS_RXFR0_BIT_OFFSET (1U)
#define RDB_STATUS_RXFR0_BIT_LEN (1U)
#define RDB_STATUS_RXFR0_BIT_MASK 0x2U
#define RDB_STATUS_RXFCG0_BIT_OFFSET (0U)
#define RDB_STATUS_RXFCG0_BIT_LEN (1U)
#define RDB_STATUS_RXFCG0_BIT_MASK 0x1U

/******************************************************************************
 * @brief Bit definitions for register RDB_DIAG_MODE
 **/
#define RDB_DIAG_MODE_ID 0x10028
#define RDB_DIAG_MODE_LEN (4U)
#define RDB_DIAG_MODE_MASK 0xFFFFFFFFUL
#define RDB_DIAG_MODE_RDB_DMODE_BIT_OFFSET (0U)
#define RDB_DIAG_MODE_RDB_DMODE_BIT_LEN (3U)
#define RDB_DIAG_MODE_RDB_DMODE_BIT_MASK 0x7U

/******************************************************************************
 * @brief Bit definitions for register AES_CFG
 **/
#define AES_CFG_ID 0x10030
#define AES_CFG_LEN (4U)
#define AES_CFG_MASK 0xFFFFFFFFUL
#define AES_CFG_KEY_OTP_BIT_OFFSET (12U)
#define AES_CFG_KEY_OTP_BIT_LEN (1U)
#define AES_CFG_KEY_OTP_BIT_MASK 0x1000U
#define AES_CFG_CORE_SEL_BIT_OFFSET (11U)
#define AES_CFG_CORE_SEL_BIT_LEN (1U)
#define AES_CFG_CORE_SEL_BIT_MASK 0x800U
#define AES_CFG_TAG_SIZE_BIT_OFFSET (8U)
#define AES_CFG_TAG_SIZE_BIT_LEN (3U)
#define AES_CFG_TAG_SIZE_BIT_MASK 0x700U
#define AES_CFG_KEY_SRC_BIT_OFFSET (7U)
#define AES_CFG_KEY_SRC_BIT_LEN (1U)
#define AES_CFG_KEY_SRC_BIT_MASK 0x80U
#define AES_CFG_KEY_LOAD_BIT_OFFSET (6U)
#define AES_CFG_KEY_LOAD_BIT_LEN (1U)
#define AES_CFG_KEY_LOAD_BIT_MASK 0x40U
#define AES_CFG_KEY_ADDR_BIT_OFFSET (3U)
#define AES_CFG_KEY_ADDR_BIT_LEN (3U)
#define AES_CFG_KEY_ADDR_BIT_MASK 0x38U
#define AES_CFG_KEY_SIZE_BIT_OFFSET (1U)
#define AES_CFG_KEY_SIZE_BIT_LEN (2U)
#define AES_CFG_KEY_SIZE_BIT_MASK 0x6U
#define AES_CFG_MODE_BIT_OFFSET (0U)
#define AES_CFG_MODE_BIT_LEN (1U)
#define AES_CFG_MODE_BIT_MASK 0x1U

