00make/STM32F103-BU0x_SDK/Components/HAL/DW/decadriver/deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register STS_KEY3
 **/
#define STS_KEY3_ID 0x20018
#define STS_KEY3_LEN (4U)
#define STS_KEY3_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_IV0
 **/
#define STS_IV0_ID 0x2001c
#define STS_IV0_LEN (4U)
#define STS_IV0_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_IV1
 **/
#define STS_IV1_ID 0x20020
#define STS_IV1_LEN (4U)
#define STS_IV1_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_IV2
 **/
#define STS_IV2_ID 0x20024
#define STS_IV2_LEN (4U)
#define STS_IV2_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register STS_IV3
 **/
#define STS_IV3_ID 0x20028
#define STS_IV3_LEN (4U)
#define STS_IV3_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register LCSS_MARGIN
 **/
#define LCSS_MARGIN_ID 0x20034

/******************************************************************************
 * @brief Bit definitions for register DGC_CFG
 **/
#define DGC_CFG_ID 0x30018
#define DGC_CFG_LEN (4U)
#define DGC_CFG_MASK 0xFFFFFFFFUL
#define DGC_CFG_THR_64_BIT_OFFSET (9U)
#define DGC_CFG_THR_64_BIT_LEN (6U)
#define DGC_CFG_THR_64_BIT_MASK 0x7e00U
#define DGC_CFG_RX_TUNE_EN_BIT_OFFSET (0U)
#define DGC_CFG_RX_TUNE_EN_BIT_LEN (1U)
#define DGC_CFG_RX_TUNE_EN_BIT_MASK 0x1U

/******************************************************************************
 * @brief Bit definitions for register DGC_CFG0
 **/
#define DGC_CFG0_ID 0x3001c
#define DGC_CFG0_LEN (4U)
#define DGC_CFG0_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_CFG1
 **/
#define DGC_CFG1_ID 0x30020
#define DGC_CFG1_LEN (4U)
#define DGC_CFG1_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_0_CFG
 **/
#define DGC_LUT_0_CFG_ID 0x30038
#define DGC_LUT_0_CFG_LEN (4U)
#define DGC_LUT_0_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_1_CFG
 **/
#define DGC_LUT_1_CFG_ID 0x3003c
#define DGC_LUT_1_CFG_LEN (4U)
#define DGC_LUT_1_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_2_CFG
 **/
#define DGC_LUT_2_CFG_ID 0x30040
#define DGC_LUT_2_CFG_LEN (4U)
#define DGC_LUT_2_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_3_CFG
 **/
#define DGC_LUT_3_CFG_ID 0x30044
#define DGC_LUT_3_CFG_LEN (4U)
#define DGC_LUT_3_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_4_CFG
 **/
#define DGC_LUT_4_CFG_ID 0x30048
#define DGC_LUT_4_CFG_LEN (4U)
#define DGC_LUT_4_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_5_CFG
 **/
#define DGC_LUT_5_CFG_ID 0x3004c
#define DGC_LUT_5_CFG_LEN (4U)
#define DGC_LUT_5_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DGC_LUT_6_CFG
 **/
#define DGC_LUT_6_CFG_ID 0x30050
#define DGC_LUT_6_CFG_LEN (4U)
#define DGC_LUT_6_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register EC_CTRL
 **/
#define EC_CTRL_ID 0x40000
#define EC_CTRL_LEN (4U)
#define EC_CTRL_MASK 0xFFFFFFFFUL
#define EC_CTRL_OSTR_MODE_BIT_OFFSET (11U)
#define EC_CTRL_OSTR_MODE_BIT_LEN (1U)
#define EC_CTRL_OSTR_MODE_BIT_MASK 0x800U
#define EC_CTRL_OSTS_WAIT_BIT_OFFSET (3U)
#define EC_CTRL_OSTS_WAIT_BIT_LEN (8U)
#define EC_CTRL_OSTS_WAIT_BIT_MASK 0x7f8U

/******************************************************************************
 * @brief Bit definitions for register RX_CAL_CFG
 **/
#define RX_CAL_CFG_ID 0x4000c
#define RX_CAL_CFG_LEN (4U)
#define RX_CAL_CFG_MASK 0xFFFFFFFFUL
#define RX_CAL_CFG_COMP_DLY_BIT_OFFSET (16U)
#define RX_CAL_CFG_COMP_DLY_BIT_LEN (4U)
#define RX_CAL_CFG_COMP_DLY_BIT_MASK 0xf0000UL
#define RX_CAL_CFG_CAL_EN_BIT_OFFSET (4U)
#define RX_CAL_CFG_CAL_EN_BIT_LEN (1U)
#define RX_CAL_CFG_CAL_EN_BIT_MASK 0x10U
#define RX_CAL_CFG_CAL_MODE_BIT_OFFSET (0U)
#define RX_CAL_CFG_CAL_MODE_BIT_LEN (2U)
#define RX_CAL_CFG_CAL_MODE_BIT_MASK 0x3U

/******************************************************************************
 * @brief Bit definitions for register RX_CAL_RESI
 **/
#define RX_CAL_RESI_ID 0x40014
#define RX_CAL_RESI_LEN (4U)
#define RX_CAL_RESI_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register RX_CAL_RESQ
 **/
#define RX_CAL_RESQ_ID 0x4001c
#define RX_CAL_RESQ_LEN (4U)
#define RX_CAL_RESQ_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register RX_CAL_STS
 **/
#define RX_CAL_STS_ID 0x40020
#define RX_CAL_STS_LEN (4U)
#define RX_CAL_STS_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register GPIO_MODE
 **/
#define GPIO_MODE_ID 0x50000
#define GPIO_MODE_LEN (4U)
#define GPIO_MODE_MASK 0xFFFFFFFFUL
#define GPIO_MODE_MSGP8_MODE_BIT_OFFSET (24U)
#define GPIO_MODE_MSGP8_MODE_BIT_LEN (3U)
#define GPIO_MODE_MSGP8_MODE_BIT_MASK 0x7000000UL
#define GPIO_MODE_MSGP7_MODE_BIT_OFFSET (21U)
#define GPIO_MODE_MSGP7_MODE_BIT_LEN (3U)
#define GPIO_MODE_MSGP7_MODE_BIT_MASK 0xe00000UL
#define GPIO_MODE_MSGP6_MODE_BIT_OFFSET (18U)
#define GPIO_MODE_MSGP6_MODE_BIT_LEN (3U)
#define GPIO_MODE_MSGP6_MODE_BIT_MASK 0x1c0000UL
#define GPIO_MODE_MSGP5_MODE_BIT_OFFSET (15U)
#define GPIO_MODE_MSGP5_MODE_BIT_LEN (3U)
#define GPIO_MODE_MSGP5_MODE_BIT_MASK 0x38000UL
#define GPIO_MODE_MSGP4_MODE_BIT_OFFSET (12U)
#define GPIO_MODE_MSGP4_MODE_BIT_LEN (3U)
#define GPIO_MODE_MSGP4_MODE_BIT_MASK 0x7000U
#define GPIO_MODE_MSGP3_MODE_BIT_OFFSET (9U)
#define GPIO_MODE_MSGP3_MODE_BIT_LEN (3U)
#define GPIO_MODE_MSGP3_MODE_BIT_MASK 0xe00U
#define GPIO_MODE_MSGP2_MODE_BIT_OFFSET (6U)
#define GPIO_MODE_MSGP2_MODE_BIT_LEN (3U)
#define GPIO_MODE_MSGP2_MODE_BIT_MASK 0x1c0U
#define GPIO_MODE_MSGP1_MODE_BIT_OFFSET (3U)
#define GPIO_MODE_MSGP1_MODE_BIT_LEN (3U)
#define GPIO_MODE_MSGP1_MODE_BIT_MASK 0x38U
#define GPIO_MODE_MSGP0_MODE_BIT_OFFSET (0U)
#define GPIO_MODE_MSGP0_MODE_BIT_LEN (3U)
#define GPIO_MODE_MSGP0_MODE_BIT_MASK 0x7U

