00make/STM32F103-BU0x_SDK/Components/HAL/DW/decadriver/deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register DTUNE0
 **/
#define DTUNE0_ID 0x60000
#define DTUNE0_LEN (4U)
#define DTUNE0_MASK 0xFFFFFFFFUL
#define DTUNE0_RX_SFD_TOC_BIT_OFFSET (16U)
#define DTUNE0_RX_SFD_TOC_BIT_LEN (16U)
#define DTUNE0_RX_SFD_TOC_BIT_MASK 0xffff0000UL
#define DTUNE0_PRE_PAC_SYM_BIT_OFFSET (0U)
#define DTUNE0_PRE_PAC_SYM_BIT_LEN (2U)
#define DTUNE0_PRE_PAC_SYM_BIT_MASK 0x3U

/******************************************************************************
 * @brief Bit definitions for register DTUNE1
 **/
#define DTUNE1_ID 0x60004
#define DTUNE1_LEN (4U)
#define DTUNE1_MASK 0xFFFFFFFFUL
#define DTUNE1_PRE_TOC_BIT_OFFSET (0U)
#define DTUNE1_PRE_TOC_BIT_LEN (16U)
#define DTUNE1_PRE_TOC_BIT_MASK 0xffffU

/******************************************************************************
 * @brief Bit definitions for register DTUNE3
 **/
#define DTUNE3_ID 0x6000c
#define DTUNE3_LEN (4U)
#define DTUNE3_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register DRX_DIAG3
 **/
#define DRX_DIAG3_ID 0x60029 /*  */
#define DRX_DIAG3_LEN (4U)
#define DRX_DIAG3_MASK 0xFFFFFFFFUL
#define DRX_DIAG3_CAR_INT_BIT_OFFSET (0U)
#define DRX_DIAG3_CAR_INT_BIT_LEN (21U)
#define DRX_DIAG3_CAR_INT_BIT_MASK 0x1fffffUL

/******************************************************************************
 * @brief Bit definitions for register RF_ENABLE
 **/
#define RF_ENABLE_ID 0x70000
#define RF_ENABLE_LEN (4U)
#define RF_ENABLE_MASK 0xFFFFFFFFUL
#define RF_ENABLE_TX_SW_EN_BIT_OFFSET (25U)
#define RF_ENABLE_TX_SW_EN_BIT_LEN (1U)
#define RF_ENABLE_TX_SW_EN_BIT_MASK 0x2000000UL
#define RF_ENABLE_TX_CH5_BIT_OFFSET (13U)
#define RF_ENABLE_TX_CH5_BIT_LEN (1U)
#define RF_ENABLE_TX_CH5_BIT_MASK 0x2000U
#define RF_ENABLE_TX_EN_BIT_OFFSET (12U)
#define RF_ENABLE_TX_EN_BIT_LEN (1U)
#define RF_ENABLE_TX_EN_BIT_MASK 0x1000U
#define RF_ENABLE_TX_EN_BUF_BIT_OFFSET (11U)
#define RF_ENABLE_TX_EN_BUF_BIT_LEN (1U)
#define RF_ENABLE_TX_EN_BUF_BIT_MASK 0x800U
#define RF_ENABLE_TX_BIAS_EN_BIT_OFFSET (10U)
#define RF_ENABLE_TX_BIAS_EN_BIT_LEN (1U)
#define RF_ENABLE_TX_BIAS_EN_BIT_MASK 0x400U

/******************************************************************************
 * @brief Bit definitions for register RF_CTRL_MASK
 **/
#define RF_CTRL_MASK_ID 0x70004
#define RF_CTRL_MASK_LEN (4U)
#define RF_CTRL_MASK_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register RX_CTRL_HI
 **/
#define RX_CTRL_HI_ID 0x70010
#define RX_CTRL_HI_LEN (4U)
#define RX_CTRL_HI_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register RF_SWITCH
 **/
#define RF_SWITCH_CTRL_ID 0x70014
#define RF_SWITCH_CTRL_LEN (4U)
#define RF_SWITCH_CTRL_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register TX_CTRL_LO
 **/
#define TX_CTRL_LO_ID 0x70018
#define TX_CTRL_LO_LEN (4U)
#define TX_CTRL_LO_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register TX_CTRL_HI
 **/
#define TX_CTRL_HI_ID 0x7001c
#define TX_CTRL_HI_LEN (4U)
#define TX_CTRL_HI_MASK 0xFFFFFFFFUL
#define TX_CTRL_HI_TX_PG_DELAY_BIT_OFFSET (0U)
#define TX_CTRL_HI_TX_PG_DELAY_BIT_LEN (6U)
#define TX_CTRL_HI_TX_PG_DELAY_BIT_MASK 0x3fU

/******************************************************************************
 * @brief Bit definitions for register TX_TEST
 **/
#define TX_TEST_ID 0x70028
#define TX_TEST_LEN (4U)
#define TX_TEST_MASK 0xFFFFFFFFUL
#define TX_TEST_TX_ENTEST_CH1_BIT_OFFSET (3U)
#define TX_TEST_TX_ENTEST_CH1_BIT_LEN (1U)
#define TX_TEST_TX_ENTEST_CH1_BIT_MASK 0x8U
#define TX_TEST_TX_ENTEST_CH2_BIT_OFFSET (2U)
#define TX_TEST_TX_ENTEST_CH2_BIT_LEN (1U)
#define TX_TEST_TX_ENTEST_CH2_BIT_MASK 0x4U
#define TX_TEST_TX_ENTEST_CH3_BIT_OFFSET (1U)
#define TX_TEST_TX_ENTEST_CH3_BIT_LEN (1U)
#define TX_TEST_TX_ENTEST_CH3_BIT_MASK 0x2U
#define TX_TEST_TX_ENTEST_CH4_BIT_OFFSET (0U)
#define TX_TEST_TX_ENTEST_CH4_BIT_LEN (1U)
#define TX_TEST_TX_ENTEST_CH4_BIT_MASK 0x1U

/******************************************************************************
 * @brief Bit definitions for register SAR_TEST
 **/
#define SAR_TEST_ID 0x70034
#define SAR_TEST_LEN (4U)
#define SAR_TEST_MASK 0xFFFFFFFFUL
#define SAR_TEST_SAR_RDEN_BIT_OFFSET (2U)
#define SAR_TEST_SAR_RDEN_BIT_LEN (1U)
#define SAR_TEST_SAR_RDEN_BIT_MASK 0x4U

/******************************************************************************
 * @brief Bit definitions for register LDO_TUNE_LO
 **/
#define LDO_TUNE_LO_ID 0x70040
#define LDO_TUNE_LO_LEN (4U)
#define LDO_TUNE_LO_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register LDO_TUNE_HI
 **/
#define LDO_TUNE_HI_ID 0x70044
#define LDO_TUNE_HI_LEN (4U)
#define LDO_TUNE_HI_MASK 0xFFFFFFFFUL
#define LDO_TUNE_HI_LDO_HVAUX_TUNE_BIT_OFFSET (12U)
#define LDO_TUNE_HI_LDO_HVAUX_TUNE_BIT_LEN (4U)
#define LDO_TUNE_HI_LDO_HVAUX_TUNE_BIT_MASK 0xf000U

/******************************************************************************
 * @brief Bit definitions for register LDO_CTRL
 **/
#define LDO_CTRL_ID 0x70048
#define LDO_CTRL_LEN (4U)
#define LDO_CTRL_MASK 0xFFFFFFFFUL
#define LDO_CTRL_LDO_VDDHVTX_VREF_BIT_OFFSET (27U)
#define LDO_CTRL_LDO_VDDHVTX_VREF_BIT_LEN (1U)
#define LDO_CTRL_LDO_VDDHVTX_VREF_BIT_MASK 0x8000000UL
#define LDO_CTRL_LDO_VDDTX2_VREF_BIT_OFFSET (22U)
#define LDO_CTRL_LDO_VDDTX2_VREF_BIT_LEN (1U)
#define LDO_CTRL_LDO_VDDTX2_VREF_BIT_MASK 0x400000UL
#define LDO_CTRL_LDO_VDDTX1_VREF_BIT_OFFSET (21U)
#define LDO_CTRL_LDO_VDDTX1_VREF_BIT_LEN (1U)
#define LDO_CTRL_LDO_VDDTX1_VREF_BIT_MASK 0x200000UL
#define LDO_CTRL_LDO_VDDHVTX_EN_BIT_OFFSET (11U)
#define LDO_CTRL_LDO_VDDHVTX_EN_BIT_LEN (1U)
#define LDO_CTRL_LDO_VDDHVTX_EN_BIT_MASK 0x800U
#define LDO_CTRL_LDO_VDDIF2_EN_BIT_OFFSET (8U)
#define LDO_CTRL_LDO_VDDIF2_EN_BIT_LEN (1U)
#define LDO_CTRL_LDO_VDDIF2_EN_BIT_MASK 0x100U
#define LDO_CTRL_LDO_VDDTX2_EN_BIT_OFFSET (6U)
#define LDO_CTRL_LDO_VDDTX2_EN_BIT_LEN (1U)
#define LDO_CTRL_LDO_VDDTX2_EN_BIT_MASK 0x40U
#define LDO_CTRL_LDO_VDDTX1_EN_BIT_OFFSET (5U)
#define LDO_CTRL_LDO_VDDTX1_EN_BIT_LEN (1U)
#define LDO_CTRL_LDO_VDDTX1_EN_BIT_MASK 0x20U
#define LDO_CTRL_LDO_VDDPLL_EN_BIT_OFFSET (4U)
#define LDO_CTRL_LDO_VDDPLL_EN_BIT_LEN (1U)
#define LDO_CTRL_LDO_VDDPLL_EN_BIT_MASK 0x10U
#define LDO_CTRL_LDO_VDDMS3_EN_BIT_OFFSET (2U)
#define LDO_CTRL_LDO_VDDMS3_EN_BIT_LEN (1U)
#define LDO_CTRL_LDO_VDDMS3_EN_BIT_MASK 0x4U
#define LDO_CTRL_LDO_VDDMS2_EN_BIT_OFFSET (1U)
#define LDO_CTRL_LDO_VDDMS2_EN_BIT_LEN (1U)
#define LDO_CTRL_LDO_VDDMS2_EN_BIT_MASK 0x2U
#define LDO_CTRL_LDO_VDDMS1_EN_BIT_OFFSET (0U)
#define LDO_CTRL_LDO_VDDMS1_EN_BIT_LEN (1U)
#define LDO_CTRL_LDO_VDDMS1_EN_BIT_MASK 0x1U

