00make/STM32F103-BU0x_SDK/Components/HAL/DW/decadriver/deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register LDO_RLOAD
 **/
#define LDO_RLOAD_ID 0x70050
#define LDO_RLOAD_LEN (4U)
#define LDO_RLOAD_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register SAR_CTRL
 **/
#define SAR_CTRL_ID 0x80000
#define SAR_CTRL_LEN (4U)
#define SAR_CTRL_MASK 0xFFFFFFFFUL
#define SAR_CTRL_SAR_START_BIT_OFFSET (0U)
#define SAR_CTRL_SAR_START_BIT_LEN (1U)
#define SAR_CTRL_SAR_START_BIT_MASK 0x1U

/******************************************************************************
 * @brief Bit definitions for register SAR_STATUS
 **/
#define SAR_STATUS_ID 0x80004
#define SAR_STATUS_LEN (4U)
#define SAR_STATUS_MASK 0xFFFFFFFFUL
#define SAR_STATUS_SAR_DONE_BIT_OFFSET (0U)
#define SAR_STATUS_SAR_DONE_BIT_LEN (1U)
#define SAR_STATUS_SAR_DONE_BIT_MASK 0x1U

/******************************************************************************
 * @brief Bit definitions for register SAR_READING
 **/
#define SAR_READING_ID 0x80008
#define SAR_READING_LEN (4U)
#define SAR_READING_MASK 0xFFFFFFFFUL
#define SAR_READING_SAR_READING_TEMP_BIT_OFFSET (8U)
#define SAR_READING_SAR_READING_TEMP_BIT_LEN (8U)
#define SAR_READING_SAR_READING_TEMP_BIT_MASK 0xff00U
#define SAR_READING_SAR_READING_VBAT_BIT_OFFSET (0U)
#define SAR_READING_SAR_READING_VBAT_BIT_LEN (8U)
#define SAR_READING_SAR_READING_VBAT_BIT_MASK 0xffU

/******************************************************************************
* @brief Bit definitions for register SAR_WAKE_RD

**/
#define SAR_WAKE_RD_ID 0x8000c
#define SAR_WAKE_RD_LEN (4U)
#define SAR_WAKE_RD_MASK 0xFFFFFFFFUL
#define SAR_WAKE_RD_SAR_LAST_TEMP_BIT_OFFSET (8U)
#define SAR_WAKE_RD_SAR_LAST_TEMP_BIT_LEN (8U)
#define SAR_WAKE_RD_SAR_LAST_TEMP_BIT_MASK 0xff00U
#define SAR_WAKE_RD_SAR_LAST_VBAT_BIT_OFFSET (0U)
#define SAR_WAKE_RD_SAR_LAST_VBAT_BIT_LEN (8U)
#define SAR_WAKE_RD_SAR_LAST_VBAT_BIT_MASK 0xffU

/******************************************************************************
 * @brief Bit definitions for register PGC_CTRL
 **/
#define PGC_CTRL_ID 0x80010
#define PGC_CTRL_LEN (4U)
#define PGC_CTRL_MASK 0xFFFFFFFFUL
#define PGC_CTRL_PGC_AUTO_CAL_BIT_OFFSET (1U)
#define PGC_CTRL_PGC_AUTO_CAL_BIT_LEN (1U)
#define PGC_CTRL_PGC_AUTO_CAL_BIT_MASK 0x2U
#define PGC_CTRL_PGC_START_BIT_OFFSET (0U)
#define PGC_CTRL_PGC_START_BIT_LEN (1U)
#define PGC_CTRL_PGC_START_BIT_MASK 0x1U

/******************************************************************************
 * @brief Bit definitions for register PGC_STATUS
 **/
#define PGC_STATUS_ID 0x80014
#define PGC_STATUS_LEN (4U)
#define PGC_STATUS_MASK 0xFFFFFFFFUL
#define PGC_STATUS_AUTOCAL_DONE_BIT_OFFSET (12U)
#define PGC_STATUS_AUTOCAL_DONE_BIT_LEN (1U)
#define PGC_STATUS_AUTOCAL_DONE_BIT_MASK 0x1000U
#define PGC_STATUS_PG_DELAY_COUNT_BIT_OFFSET (0U)
#define PGC_STATUS_PG_DELAY_COUNT_BIT_LEN (12U)
#define PGC_STATUS_PG_DELAY_COUNT_BIT_MASK 0xfffU

/******************************************************************************
 * @brief Bit definitions for register PG_TEST
 **/
#define PG_TEST_ID 0x80018
#define PG_TEST_LEN (4U)
#define PG_TEST_MASK 0xFFFFFFFFUL
#define PG_TEST_TX_TEST_CH4_BIT_OFFSET (12U)
#define PG_TEST_TX_TEST_CH4_BIT_LEN (4U)
#define PG_TEST_TX_TEST_CH4_BIT_MASK 0xf000U
#define PG_TEST_TX_TEST_CH3_BIT_OFFSET (8U)
#define PG_TEST_TX_TEST_CH3_BIT_LEN (4U)
#define PG_TEST_TX_TEST_CH3_BIT_MASK 0xf00U
#define PG_TEST_TX_TEST_CH2_BIT_OFFSET (4U)
#define PG_TEST_TX_TEST_CH2_BIT_LEN (4U)
#define PG_TEST_TX_TEST_CH2_BIT_MASK 0xf0U
#define PG_TEST_TX_TEST_CH1_BIT_OFFSET (0U)
#define PG_TEST_TX_TEST_CH1_BIT_LEN (4U)
#define PG_TEST_TX_TEST_CH1_BIT_MASK 0xfU

/******************************************************************************
 * @brief Bit definitions for register PG_CAL_TARGET
 **/
#define PG_CAL_TARGET_ID 0x8001c
#define PG_CAL_TARGET_LEN (4U)
#define PG_CAL_TARGET_MASK 0xFFFFFFFFUL
#define PG_CAL_TARGET_TARGET_BIT_OFFSET (0U)
#define PG_CAL_TARGET_TARGET_BIT_LEN (12U)
#define PG_CAL_TARGET_TARGET_BIT_MASK 0xfffU

/******************************************************************************
 * @brief Bit definitions for register PLL_CFG
 **/
#define PLL_CFG_ID 0x90000
#define PLL_CFG_LEN (4U)
#define PLL_CFG_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register PLL_CAL
 **/
#define PLL_CAL_ID 0x90008
#define PLL_CAL_LEN (4U)
#define PLL_CAL_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register XTAL
 **/
#define XTAL_ID 0x90014
#define XTAL_LEN (4U)
#define XTAL_MASK 0xFFFFFFFFUL
#define XTAL_XTAL_TRIM_BIT_OFFSET (0U)
#define XTAL_XTAL_TRIM_BIT_LEN (7U)
#define XTAL_XTAL_TRIM_BIT_MASK 0x7fU

/******************************************************************************
 * @brief Bit definitions for register AON_DIG_CFG
 **/
#define AON_DIG_CFG_ID 0xa0000
#define AON_DIG_CFG_LEN (4U)
#define AON_DIG_CFG_MASK 0xFFFFFFFFUL
#define AON_DIG_CFG_ONWAKE_GO2RX_BIT_OFFSET (9U)
#define AON_DIG_CFG_ONWAKE_GO2RX_BIT_LEN (1U)
#define AON_DIG_CFG_ONWAKE_GO2RX_BIT_MASK 0x200U
#define AON_DIG_CFG_ONWAKE_GO2IDLE_BIT_OFFSET (8U)
#define AON_DIG_CFG_ONWAKE_GO2IDLE_BIT_LEN (1U)
#define AON_DIG_CFG_ONWAKE_GO2IDLE_BIT_MASK 0x100U
#define AON_DIG_CFG_ONWAKE_RUN_SAR_BIT_OFFSET (1U)
#define AON_DIG_CFG_ONWAKE_RUN_SAR_BIT_LEN (1U)
#define AON_DIG_CFG_ONWAKE_RUN_SAR_BIT_MASK 0x2U
#define AON_DIG_CFG_ONWAKE_AON_DLD_BIT_OFFSET (0U)
#define AON_DIG_CFG_ONWAKE_AON_DLD_BIT_LEN (1U)
#define AON_DIG_CFG_ONWAKE_AON_DLD_BIT_MASK 0x1U

/******************************************************************************
 * @brief Bit definitions for register AON_CTRL
 **/
#define AON_CTRL_ID 0xa0004
#define AON_CTRL_LEN (4U)
#define AON_CTRL_MASK 0xFFFFFFFFUL
#define AON_CTRL_DCA_ENAB_BIT_OFFSET (7U)
#define AON_CTRL_DCA_ENAB_BIT_LEN (1U)
#define AON_CTRL_DCA_ENAB_BIT_MASK 0x80U
#define AON_CTRL_DCA_WRITE_HI_EN_BIT_OFFSET (5U)
#define AON_CTRL_DCA_WRITE_HI_EN_BIT_LEN (1U)
#define AON_CTRL_DCA_WRITE_HI_EN_BIT_MASK 0x20U
#define AON_CTRL_DCA_WRITE_EN_BIT_OFFSET (4U)
#define AON_CTRL_DCA_WRITE_EN_BIT_LEN (1U)
#define AON_CTRL_DCA_WRITE_EN_BIT_MASK 0x10U
#define AON_CTRL_DCA_READ_EN_BIT_OFFSET (3U)
#define AON_CTRL_DCA_READ_EN_BIT_LEN (1U)
#define AON_CTRL_DCA_READ_EN_BIT_MASK 0x8U
#define AON_CTRL_CONFIG_UPLOAD_BIT_OFFSET (2U)
#define AON_CTRL_CONFIG_UPLOAD_BIT_LEN (1U)
#define AON_CTRL_CONFIG_UPLOAD_BIT_MASK 0x4U
#define AON_CTRL_ARRAY_SAVE_BIT_OFFSET (1U)
#define AON_CTRL_ARRAY_SAVE_BIT_LEN (1U)
#define AON_CTRL_ARRAY_SAVE_BIT_MASK 0x2U
#define AON_CTRL_ARRAY_RESTORE_BIT_OFFSET (0U)
#define AON_CTRL_ARRAY_RESTORE_BIT_LEN (1U)
#define AON_CTRL_ARRAY_RESTORE_BIT_MASK 0x1U

