00make/STM32F103-BU0x_SDK/Components/HAL/DW/decadriver/deca_regs.h
/******************************************************************************
 * @brief Bit definitions for register SEQ_CTRL
 **/
#define SEQ_CTRL_ID 0x110008
#define SEQ_CTRL_LEN (4U)
#define SEQ_CTRL_MASK 0xFFFFFFFFUL
#define SEQ_CTRL_LP_CLK_DIV_BIT_OFFSET (26U)
#define SEQ_CTRL_LP_CLK_DIV_BIT_LEN (6U)
#define SEQ_CTRL_LP_CLK_DIV_BIT_MASK 0xfc000000UL
#define SEQ_CTRL_FORCE2INIT_BIT_OFFSET (23U)
#define SEQ_CTRL_FORCE2INIT_BIT_LEN (1U)
#define SEQ_CTRL_FORCE2INIT_BIT_MASK 0x800000UL
#define SEQ_CTRL_CIA_SEQ_EN_BIT_OFFSET (17U)
#define SEQ_CTRL_CIA_SEQ_EN_BIT_LEN (1U)
#define SEQ_CTRL_CIA_SEQ_EN_BIT_MASK 0x20000UL
#define SEQ_CTRL_PLL_SYNC_MODE_BIT_OFFSET (15U)
#define SEQ_CTRL_PLL_SYNC_MODE_BIT_LEN (1U)
#define SEQ_CTRL_PLL_SYNC_MODE_BIT_MASK 0x8000U
#define SEQ_CTRL_ARX2SLP_BIT_OFFSET (12U)
#define SEQ_CTRL_ARX2SLP_BIT_LEN (1U)
#define SEQ_CTRL_ARX2SLP_BIT_MASK 0x1000U
#define SEQ_CTRL_ATX2SLP_BIT_OFFSET (11U)
#define SEQ_CTRL_ATX2SLP_BIT_LEN (1U)
#define SEQ_CTRL_ATX2SLP_BIT_MASK 0x800U
#define SEQ_CTRL_AINIT2IDLE_BIT_OFFSET (8U)
#define SEQ_CTRL_AINIT2IDLE_BIT_LEN (1U)
#define SEQ_CTRL_AINIT2IDLE_BIT_MASK 0x100U

/******************************************************************************
 * @brief Bit definitions for register PWR_UP_TIMES_LO
 **/
#define PWR_UP_TIMES_LO_ID 0x110010
#define PWR_UP_TIMES_LO_LEN (4U)
#define PWR_UP_TIMES_LO_MASK 0xFFFFFFFFUL
#define PWR_UP_TIMES_TXFINESEQ_BIT_OFFSET (0U)
#define PWR_UP_TIMES_TXFINESEQ_BIT_LEN (32U)
#define PWR_UP_TIMES_TXFINESEQ_BIT_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register LED_CTRL
 **/
#define LED_CTRL_ID 0x110016 /*  */
#define LED_CTRL_LEN (4U)
#define LED_CTRL_MASK 0xFFFFFFFFUL
#define LED_CTRL_FORCE_TRIGGER_BIT_OFFSET (16U)
#define LED_CTRL_FORCE_TRIGGER_BIT_LEN (4U)
#define LED_CTRL_FORCE_TRIGGER_BIT_MASK 0xf0000UL
#define LED_CTRL_BLINK_EN_BIT_OFFSET (8U)
#define LED_CTRL_BLINK_EN_BIT_LEN (1U)
#define LED_CTRL_BLINK_EN_BIT_MASK 0x100U

/******************************************************************************
 * @brief Bit definitions for register RX_SNIFF
 **/
#define RX_SNIFF_ID 0x11001a /*  { aliased = true}  */
#define RX_SNIFF_LEN (4U)
#define RX_SNIFF_MASK 0xFFFFFFFFUL
#define RX_SNIFF_SNIFF_OFF_BIT_OFFSET (8U)
#define RX_SNIFF_SNIFF_OFF_BIT_LEN (8U)
#define RX_SNIFF_SNIFF_OFF_BIT_MASK 0xff00U
#define RX_SNIFF_SNIFF_ON_BIT_OFFSET (0U)
#define RX_SNIFF_SNIFF_ON_BIT_LEN (4U)
#define RX_SNIFF_SNIFF_ON_BIT_MASK 0xfU

/******************************************************************************
 * @brief Bit definitions for register BIAS_CTRL
 **/
#define BIAS_CTRL_ID 0x11001f /*  */
#define BIAS_CTRL_LEN (4U)
#define BIAS_CTRL_MASK 0xFFFFFFFFUL
#define BIAS_CTRL_BIAS_OFFSET (0U)
#define BIAS_CTRL_BIAS_LEN (5U)
#define BIAS_CTRL_BIAS_MASK 0x1fU

/******************************************************************************
 * @brief Bit definitions for register FINT_STAT
 **/
#define FINT_STAT_ID 0x1F0000
#define FINT_STAT_LEN (4U)
#define FINT_STAT_MASK 0xFFFFFFFFUL
#define FINT_STAT_SYS_PANIC_BIT_MASK 0x80U
#define FINT_STAT_SYS_EVENT_BIT_MASK 0x40U
#define FINT_STAT_RXTO_BIT_MASK 0x20U
#define FINT_STAT_RXERR_BIT_MASK 0x10U
#define FINT_STAT_RXOK_BIT_MASK 0x8U
#define FINT_STAT_RXTSERR_BIT_MASK 0x4U
#define FINT_STAT_CCA_FAIL_AAT_BIT_MASK 0x2U
#define FINT_STAT_TXOK_BIT_MASK 0x1U

/******************************************************************************
 * @brief Bit definitions for register INDIRECT_ADDR_A
 **/
#define INDIRECT_ADDR_A_ID 0x1f0004
#define INDIRECT_ADDR_A_LEN (4U)
#define INDIRECT_ADDR_A_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register ADDR_OFFSET_A
 **/
#define ADDR_OFFSET_A_ID 0x1f0008
#define ADDR_OFFSET_A_LEN (4U)
#define ADDR_OFFSET_A_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register INDIRECT_ADDR_B
 **/
#define INDIRECT_ADDR_B_ID 0x1f000c
#define INDIRECT_ADDR_B_LEN (4U)
#define INDIRECT_ADDR_B_MASK 0xFFFFFFFFUL

/******************************************************************************
 * @brief Bit definitions for register ADDR_OFFSET_B
 **/
#define ADDR_OFFSET_B_ID 0x1f0010
#define ADDR_OFFSET_B_LEN (4U)
#define ADDR_OFFSET_B_MASK 0xFFFFFFFFUL

#ifdef __cplusplus
}
#endif
#endif /* __DECA_REGS_H */
